## Plan Result (staging - TerraformPlanApply)




<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.baubaiscontributor
  * azurerm_role_assignment.teamcontributor
* Update
  * azurerm_synapse_workspace.this
  * module.storage.azurerm_storage_account.storage_account




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.baubaiscontributor will be created
  + resource "azurerm_role_assignment" "baubaiscontributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6c9985b3-1f04-4701-b9d3-dc01b1dc610e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Storage/storageAccounts/baubaisadfsastg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.teamcontributor will be created
  + resource "azurerm_role_assignment" "teamcontributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "257ca1f6-7ef6-4e7d-b43b-cb2d4d849fdc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Storage/storageAccounts/baubaisadfsastg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_synapse_workspace.this will be updated in-place
  ~ resource "azurerm_synapse_workspace" "this" {
        id                                   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Synapse/workspaces/baubais-synapse-stg"
        name                                 = "baubais-synapse-stg"
        tags                                 = {
            "application"  = "baubais"
            "builtFrom"    = "hmcts/juror-er-infra"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (13 unchanged attributes hidden)

      + github_repo {
          + account_name    = "hmcts"
          + branch_name     = "main"
          + git_url         = "https://github.com"
          + repository_name = "juror-er-infra"
          + root_folder     = "/synapse"
        }

        # (2 unchanged blocks hidden)
    }

  # module.storage.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Storage/storageAccounts/synapsebaubaisstg"
        name                               = "synapsebaubaisstg"
        tags                               = {
            "application"  = "baubais"
            "builtFrom"    = "hmcts/juror-er-infra"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":14,"Program":"tfcmt","SHA1":"","Target":"staging - TerraformPlanApply","Vars":{}} -->